templates/updateClientDetails00002-request.xml.erb

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://services.acuritywebservices.finsyn.com.au/">
   <soapenv:Header/>
   <soapenv:Body>
      <ser:updateClientDetails00002>
         <endUser><%= end_user %></endUser>
         <!--Optional:-->
         <ClientInput>
            <D2z_Bank_Acct_No></D2z_Bank_Acct_No>
            <D2z_Phone_Sec_No></D2z_Phone_Sec_No>
            <D2c_Block_Paymts></D2c_Block_Paymts>
            <D2z_Sex></D2z_Sex>
            <D2z_Title></D2z_Title>
            <D2z_Marital_Status></D2z_Marital_Status>
            <D2z_Occupation></D2z_Occupation>
            <D2c_Smoker></D2c_Smoker>
            <D2z_Birth_Place></D2z_Birth_Place>
            <D2z_Occupation_Name></D2z_Occupation_Name>
            <D2z_Bank_Acct_Name></D2z_Bank_Acct_Name>
            <D2z_Email></D2z_Email>
            <D2z_Fax></D2z_Fax>
            <D2z_Country></D2z_Country>
            <D2z_Address_Line_2></D2z_Address_Line_2>
            <D2z_Address_Line_3></D2z_Address_Line_3>
            <D2z_Suburb></D2z_Suburb>
            <D2z_State></D2z_State>
            <D2z_Post_Code></D2z_Post_Code>
            <D2z_Home_Phone></D2z_Home_Phone>
            <D2z_Work_Phone></D2z_Work_Phone>
            <D2z_Previous_Line_2></D2z_Previous_Line_2>
            <D2z_Previous_Line_3></D2z_Previous_Line_3>
            <D2z_Previous_Suburb></D2z_Previous_Suburb>
            <D2z_Previous_State></D2z_Previous_State>
            <D2z_Prev_Post_Code></D2z_Prev_Post_Code>
            <D2z_Tax_File_No></D2z_Tax_File_No>
            <D2z_Broker01></D2z_Broker01>
            <D2z_Broker02></D2z_Broker02>
            <D2z_Broker03></D2z_Broker03>
            <D2z_Broker04></D2z_Broker04>
            <D2z_Broker05></D2z_Broker05>
            <D2z_Broker06></D2z_Broker06>
            <D2z_Broker07></D2z_Broker07>
            <D2z_Status></D2z_Status>
            <D2z_Previous_Surname></D2z_Previous_Surname>
            <D2z_Previous_GivenNm></D2z_Previous_GivenNm>
            <D2z_Assigned></D2z_Assigned>
            <D2c_TFN_Releasable></D2c_TFN_Releasable>
            <D2z_Soundex></D2z_Soundex>
            <D2z_Bank_Acct_Paymts></D2z_Bank_Acct_Paymts>
            <D2c_Aust_Resident></D2c_Aust_Resident>
            <D2z_Trust_Name></D2z_Trust_Name>
            <D2z_Trustee_Name></D2z_Trustee_Name>
            <D2z_Mobile_Phone></D2z_Mobile_Phone>
            <D2c_Halt_Corres></D2c_Halt_Corres>
            <D2c_Prev_Address_Upd></D2c_Prev_Address_Upd>
            <D2z_DPID_Code></D2z_DPID_Code>
            <D2z_Aust_Comp_No></D2z_Aust_Comp_No>
            <D2c_Exc_Client_Merge></D2c_Exc_Client_Merge>
            <D2z_Receive_Docs></D2z_Receive_Docs>
            <D2z_ACN></D2z_ACN>
            <D2z_BSB></D2z_BSB>
            <D2c_Australian_Addr></D2c_Australian_Addr>
            <D2z_Country_Code></D2z_Country_Code>
            <D2z_ResidencyCode></D2z_ResidencyCode>
            <D2z_Email2></D2z_Email2>
            <D2c_Email_Flag></D2c_Email_Flag>
            <D2c_Email2_Flag></D2c_Email2_Flag>
            <D2z_Spouse></D2z_Spouse>
            <D2z_Surname></D2z_Surname>
            <D2z_Given_Names></D2z_Given_Names>
            <D2z_Prev_Ctry_Code></D2z_Prev_Ctry_Code>
            <D2z_Prev_DPID_Code></D2z_Prev_DPID_Code>
            <D2c_Mail_Address></D2c_Mail_Address>
            <D2z_Bpay_Ref></D2z_Bpay_Ref>
            <D2z_KYC_Status></D2z_KYC_Status>
            <D2z_Res_Addr_Line_1></D2z_Res_Addr_Line_1>
            <D2z_Res_Addr_Line_2></D2z_Res_Addr_Line_2>
            <D2z_Res_Addr_Line_3></D2z_Res_Addr_Line_3>
            <D2z_Res_Suburb></D2z_Res_Suburb>
            <D2z_Res_State></D2z_Res_State>
            <D2z_Res_Post_Code></D2z_Res_Post_Code>
            <D2z_Res_Country></D2z_Res_Country>
            <D2z_Res_Country_Code></D2z_Res_Country_Code>
            <D2c_Res_Aust_Addr></D2c_Res_Aust_Addr>
            <D2z_Res_DPID_Code></D2z_Res_DPID_Code>
            <D2c_Res_Mail_Address></D2c_Res_Mail_Address>
            <D2c_Postal_Address></D2c_Postal_Address>
            <D2z_Risk_Level></D2z_Risk_Level>
            <D2z_Assessed></D2z_Assessed>
            <D2c_Prevent_TFN_Upd></D2c_Prevent_TFN_Upd>
            <D2c_Flood_Affected></D2c_Flood_Affected>
            <D2z_Inst_Code></D2z_Inst_Code>
            <D2z_Inst_Cust_No></D2z_Inst_Cust_No>
            <D2d_Birth></D2d_Birth>
            <D2d_Current_Name></D2d_Current_Name>
            <D2d_Current_Address></D2d_Current_Address>
            <D2d_Last_Worked></D2d_Last_Worked>
            <D2d_Eligible_Service></D2d_Eligible_Service>
            <D2d_TFN_Supplied></D2d_TFN_Supplied>
            <D2d_KYC_Supplied></D2d_KYC_Supplied>
            <D2d_Assessment_Date></D2d_Assessment_Date>
            <D2d_Term_Med_Start></D2d_Term_Med_Start>
            <D2f_Broker_Pcnt01></D2f_Broker_Pcnt01>
            <D2f_Broker_Pcnt02></D2f_Broker_Pcnt02>
            <D2f_Broker_Pcnt03></D2f_Broker_Pcnt03>
            <D2f_Broker_Pcnt04></D2f_Broker_Pcnt04>
            <D2f_Broker_Pcnt05></D2f_Broker_Pcnt05>
            <D2f_Broker_Pcnt06></D2f_Broker_Pcnt06>
            <D2f_Broker_Pcnt07></D2f_Broker_Pcnt07>
            <D2z_Rev_Relationship></D2z_Rev_Relationship>
            <D2z_Addr_Status></D2z_Addr_Status>
            <D2z_Res_Addr_Status></D2z_Res_Addr_Status>
            <D2z_Client></D2z_Client>
         </ClientInput>
      </ser:updateClientDetails00002>
   </soapenv:Body>
</soapenv:Envelope>